![texto alternativo](https://user-images.githubusercontent.com/50641494/85175904-ebb62f00-b24e-11ea-81cb-438de552e34d.PNG)

üêç 2021


![](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F22e8a50c-f313-4d66-adaa-bbed91992723%2FUntitled.png?table=block&id=af1566d2-7579-41dd-9dbb-07f099d3bb8f&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=950&userId=&cache=v2)

[clase en texto](https://www.notion.so/Clase-Pandas-512e9f6d961f443ea82a9db35f4b0216)

## 01 Levantar los datos

## Traemos datos desde Github

In [ ]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/phdnico/ejemplo_con_pandas/main/datos.csv")

In [ ]:
df

,Marca temporal,Nombre,Apellido,Nickname o apodo,Edad,Conocimiento de programaci√≥n con Python,A√±o de Nacimiento
0,25/05/2021 18:09:06,Jose Maria,Vallorani,JoseMa,20,Mucho,1900
1,25/05/2021 16:44:39,Maria-Ines,Orellana,Maru,78,Algo,1942
2,26/05/2021 16:44:39,Agustin,Bonilla,Tincho,31,Bastante,1989
3,27/05/2021 16:44:39,Ioan,Cervera,NaN,23,Mucho,1997
4,28/05/2021 16:44:39,Avelina,Haro,NaN,34,Mucho,1986
5,29/05/2021 16:44:39,Anastasia,Picazo,NaN,78,Nada,1942
6,30/05/2021 16:44:39,Yaiza,Oliver,NaN,22,Algo,1995
7,31/05/2021 16:44:39,Arturo,Sanchez,Rey,19,Bastante,2001
8,1/06/2021 16:44:39,Jose,Casas,Pepe,22,Mucho,1998
9,2/06/2021 16:44:39,Cristian,Verdugo,NaN,21,Mucho,1999

In [ ]:
df.columns

Index(['Marca temporal', 'Nombre', 'Apellido', 'Nickname o apodo ', 'Edad',
       'Conocimiento de programaci√≥n con Python', 'A√±o de Nacimiento '],
      dtype='object')

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df

        Marca temporal  ... A√±o de Nacimiento
0  25/05/2021 18:09:06  ...               1900
1  25/05/2021 16:44:39  ...               1942
2  26/05/2021 16:44:39  ...               1989
3  27/05/2021 16:44:39  ...               1997
4  28/05/2021 16:44:39  ...               1986
5  29/05/2021 16:44:39  ...               1942
6  30/05/2021 16:44:39  ...               1995
7  31/05/2021 16:44:39  ...               2001
8   1/06/2021 16:44:39  ...               1998
9   2/06/2021 16:44:39  ...               1999

[10 rows x 7 columns]

In [ ]:
df['Nombre']

0    Jose Maria
1    Maria-Ines
2       Agustin
3          Ioan
4       Avelina
5     Anastasia
6         Yaiza
7        Arturo
8          Jose
9     Cristian
Name: Nombre, dtype: object

In [ ]:
df['Edad']

0    20
1    78
2    31
3    23
4    34
5    78
6    22
7    19
8    22
9    21
Name: Edad, dtype: int64

In [ ]:
#ver por fila
df.loc[0]

Marca temporal                             25/05/2021 18:09:06
Nombre                                              Jose Maria
Apellido                                             Vallorani
Nickname o apodo                                        JoseMa
Edad                                                        20
Conocimiento de programaci√≥n con Python                  Mucho
A√±o de Nacimiento                                         1900
Name: 0, dtype: object

## 02 Preparar los datos

### 02.01 Eliminar la columna "Marca temporal", no brinda informaci√≥n

![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F7289b927-6975-43b1-846e-ea2cfccb3de4%2FUntitled.png?table=block&id=240eabaf-20c4-46c9-ad7f-3de63d57e831&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=2580&userId=&cache=v2)

In [ ]:
del df['Marca temporal']

In [ ]:
df

       Nombre  ... A√±o de Nacimiento
0  Jose Maria  ...               1900
1  Maria-Ines  ...               1942
2     Agustin  ...               1989
3        Ioan  ...               1997
4     Avelina  ...               1986
5   Anastasia  ...               1942
6       Yaiza  ...               1995
7      Arturo  ...               2001
8        Jose  ...               1998
9   Cristian   ...               1999

[10 rows x 6 columns]

### 02.02 Renombrar las columnas, de momento tenemos nombres de columnas muy extensos

![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fe9619710-828a-4cbf-8369-4c7e8cba6997%2FUntitled.png?table=block&id=f5460654-c3cd-4719-95e5-2eec9a574d03&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=2240&userId=&cache=v2)

*Los nombres de las columnas son:*

In [ ]:
df.columns

Index(['Nombre', 'Apellido', 'Nickname o apodo ', 'Edad',
       'Conocimiento de programaci√≥n con Python', 'A√±o de Nacimiento '],
      dtype='object')

Para cambiar los nombres utilizaremos **.rename**
![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F1bab3661-fc1c-40f4-9fa4-76500701763b%2FUntitled.png?table=block&id=a1c6b6d4-a9f4-46d0-a06a-dddb0e692d34&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=590&userId=&cache=v2)

In [ ]:
df = df.rename(columns={'Nombre':'nombre',
                   'Apellido':'apellido',
                   'Nickname o apodo ':'apodo',
                   'Edad':'edad',
                   'Conocimiento de programaci√≥n con Python':'level',
                   'A√±o de Nacimiento ':'nacimiento'})

In [ ]:
df

       nombre   apellido   apodo  edad     level  nacimiento
0  Jose Maria  Vallorani  JoseMa    20     Mucho        1900
1  Maria-Ines   Orellana    Maru    78      Algo        1942
2     Agustin    Bonilla  Tincho    31  Bastante        1989
3        Ioan    Cervera     NaN    23     Mucho        1997
4     Avelina       Haro     NaN    34     Mucho        1986
5   Anastasia     Picazo     NaN    78      Nada        1942
6       Yaiza     Oliver     NaN    22      Algo        1995
7      Arturo    Sanchez     Rey    19  Bastante        2001
8        Jose      Casas    Pepe    22     Mucho        1998
9   Cristian     Verdugo     NaN    21     Mucho        1999

### 02.03 Conocer las dimensiones del dataframe
![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fc66f2269-8930-4037-86f7-ea91e26a0283%2FUntitled.png?table=block&id=14ff6f2d-9a59-43a1-85c7-aba655b5fadf&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=1490&userId=&cache=v2)

In [ ]:
df.shape

(10, 6)

In [ ]:
df.size

60

In [ ]:
filas = df.shape[0]
columnas = df.shape[1]

print(filas)
print(columnas)

10
7

### 02.04 Recorrer las columnas

1.   Por nombre
2.   Por posici√≥n (no recomendado)

In [ ]:
df['nombre']

In [ ]:
df.iloc[:,3] # empezamos desde Cero

0    20
1    78
2    31
3    23
4    34
5    78
6    22
7    19
8    22
9    21
Name: Edad, dtype: int64

### 02.05 Hallar en la columna edad:

1.   el valor m√≠nimo **min()**
2.   el valor m√°ximo **max()**
3.   la suma de todas las edades **sum()**

In [ ]:
df['edad'].min()

In [ ]:
df['edad'].max()

In [ ]:
df['edad'].sum()

## 03 Conceptos nuevos: ¬øqu√© pasa cuando un campo esta vac√≠o¬¥?

### 03.01 muestre la columna 'apodo' y comente

In [ ]:
df['apodo']

![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F29ce407a-d926-42a9-8d24-004f6db9d023%2FUntitled.png?table=block&id=13a80d40-5ce2-4f36-baae-5015dcee08d3&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=680&userId=&cache=v2)


Viendo la hoja de c√°lculo
![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F907d5466-1e8b-4150-9ea0-948fe23b99dd%2FUntitled.png?table=block&id=944b732c-caa2-4993-a794-9c5036ccd060&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=2490&userId=&cache=v2)

## 04 **Primer desaf√≠o** üïµÔ∏è‚Äç‚ôÄÔ∏è : Deberemos reemplazar los valores NaN en la columna "apodo" por el nombre concatenado con el apellido, siguiendo estas condiciones:

1.   Hallar las posiciones donde aparecen los NaN
2.   De la columna nombre si la longitud ‚â§5 completar el apodo con el nombre
3.   Si la longitud del nombre es >5 tomar las 4 primeras letras y concatenar con las 2 primeras letras del apellido

### 04.01 posiciones donde aparecen NaN

In [ ]:
pd.isna(df["apodo"])

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7    False
8    False
9     True
Name: apodo, dtype: bool

In [ ]:
df.loc[pd.isna(df["apodo"]), :].index
# cantidad de NaN en la columna 'apodo'
#pd.isna(df["apodo"]).sum()

Int64Index([3, 4, 5, 6, 9], dtype='int64')

In [ ]:
pd.isna(df["apodo"]).sum()

5

### 04.02 Veamos los puntos 2 y 3 del primer desaf√≠o, para la

---

posici√≥n 3

In [ ]:
df

       nombre   apellido   apodo  edad     level  nacimiento
0  Jose Maria  Vallorani  JoseMa    20     Mucho        1900
1  Maria-Ines   Orellana    Maru    78      Algo        1942
2     Agustin    Bonilla  Tincho    31  Bastante        1989
3        Ioan    Cervera     NaN    23     Mucho        1997
4     Avelina       Haro     NaN    34     Mucho        1986
5   Anastasia     Picazo     NaN    78      Nada        1942
6       Yaiza     Oliver     NaN    22      Algo        1995
7      Arturo    Sanchez     Rey    19  Bastante        2001
8        Jose      Casas    Pepe    22     Mucho        1998
9   Cristian     Verdugo     NaN    21     Mucho        1999

In [ ]:
df['nombre'][3]

'Ioan'

In [ ]:
len(df['nombre'][3])

4

#### 04.02.01 Actulizar el valor de una celda df.at[index,'columna'] = 'nuevo valor'

In [ ]:
df.at[3, 'apodo'] = 'Ioan'
df

       nombre   apellido   apodo  edad     level  nacimiento
0  Jose Maria  Vallorani  JoseMa    20     Mucho        1900
1  Maria-Ines   Orellana    Maru    78      Algo        1942
2     Agustin    Bonilla  Tincho    31  Bastante        1989
3        Ioan    Cervera    Ioan    23     Mucho        1997
4     Avelina       Haro     NaN    34     Mucho        1986
5   Anastasia     Picazo     NaN    78      Nada        1942
6       Yaiza     Oliver     NaN    22      Algo        1995
7      Arturo    Sanchez     Rey    19  Bastante        2001
8        Jose      Casas    Pepe    22     Mucho        1998
9   Cristian     Verdugo     NaN    21     Mucho        1999

#### 04.02.02 Veamos los puntos 2 y 3 del primer desaf√≠o, para la posici√≥n 4

In [ ]:
df['nombre'][4]

'Avelina'

In [ ]:
len(df['nombre'][4])

7

In [ ]:
## Avelina => longitud 7 => solo usar los 4 valores

nombre                Jose Maria
Apellido               Vallorani
apodo                     JoseMa
edad                          20
level                      Mucho
A√±o de Nacimiento           1900
Name: 0, dtype: object

In [ ]:
len(df['apellido'][4])

4

#### 04.02.03 Recordemos ... strings

In [ ]:
var_nombre = df['nombre'][4] # posici√≥n 4
print(var_nombre)

Avelina

In [ ]:
var_nombre[0:4]

'Avel'

In [ ]:
## Todo junto y concatenando nos queda
var_nombre = df['nombre'][4][0:4] # solo tomo 4 letras
var_apellido = df['apellido'][4][0:2] # solo tomo 2 letras

print(var_nombre)
print(var_apellido)
## Concatenamos
var_apodo = var_nombre + var_apellido
print("--------")
print(var_apodo)

Avel
Ha
--------
AvelHa

#### 04.02.04 Strings + pandas a full üßô‚Äç‚ôÇÔ∏è

In [ ]:
var_apodo = df['nombre'][4][0:4]+df['apellido'][4][0:2]
var_apodo

'AvelHa'

In [ ]:
df

       nombre   apellido   apodo  edad     level  nacimiento
0  Jose Maria  Vallorani  JoseMa    20     Mucho        1900
1  Maria-Ines   Orellana    Maru    78      Algo        1942
2     Agustin    Bonilla  Tincho    31  Bastante        1989
3        Ioan    Cervera    Ioan    23     Mucho        1997
4     Avelina       Haro     NaN    34     Mucho        1986
5   Anastasia     Picazo     NaN    78      Nada        1942
6       Yaiza     Oliver     NaN    22      Algo        1995
7      Arturo    Sanchez     Rey    19  Bastante        2001
8        Jose      Casas    Pepe    22     Mucho        1998
9   Cristian     Verdugo     NaN    21     Mucho        1999

In [ ]:
## y para finalizar este ejemplo a mano ...
df.at[4, 'apodo'] = var_apodo
df

       nombre   apellido   apodo  edad     level  nacimiento
0  Jose Maria  Vallorani  JoseMa    20     Mucho        1900
1  Maria-Ines   Orellana    Maru    78      Algo        1942
2     Agustin    Bonilla  Tincho    31  Bastante        1989
3        Ioan    Cervera    Ioan    23     Mucho        1997
4     Avelina       Haro  AvelHa    34     Mucho        1986
5   Anastasia     Picazo     NaN    78      Nada        1942
6       Yaiza     Oliver     NaN    22      Algo        1995
7      Arturo    Sanchez     Rey    19  Bastante        2001
8        Jose      Casas    Pepe    22     Mucho        1998
9   Cristian     Verdugo     NaN    21     Mucho        1999

### 04.03 Esquema del primer desaf√≠o nos queda:  ![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F444a628e-0543-47f5-8c17-9862a9a1b455%2FUntitled.png?table=block&id=065092b2-74b7-4c08-a469-db7f94ef0f6d&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=1860&userId=&cache=v2)

#### 04.03.01 Recordemos el ciclo for

In [ ]:
filas = df.shape[0]
for i in range(0,filas):
  if(pd.isna(df["apodo"][i])): # pd.isna()
    print(i)
    print("es NaN")
#solo aparecen 5,6,9 ya que actualizamos los √≠ndices 3 y 4

5
es NaN
6
es NaN
9
es NaN

In [ ]:
df

       nombre   apellido   apodo  edad     level  nacimiento
0  Jose Maria  Vallorani  JoseMa    20     Mucho        1900
1  Maria-Ines   Orellana    Maru    78      Algo        1942
2     Agustin    Bonilla  Tincho    31  Bastante        1989
3        Ioan    Cervera    Ioan    23     Mucho        1997
4     Avelina       Haro  AvelHa    34     Mucho        1986
5   Anastasia     Picazo     NaN    78      Nada        1942
6       Yaiza     Oliver     NaN    22      Algo        1995
7      Arturo    Sanchez     Rey    19  Bastante        2001
8        Jose      Casas    Pepe    22     Mucho        1998
9   Cristian     Verdugo     NaN    21     Mucho        1999

### 04.04 Filnalicemos el desaf√≠o üë©‚Äçüíª

In [ ]:
filas = df.shape[0]
for i in range(0,filas):
  if(pd.isna(df["apodo"][i])): # pd.isna()
    if(len(df['nombre'][i])<=5):
      var_apodo = df['nombre'][i]
      df.at[i, 'apodo'] = var_apodo
    else:
      var_apodo = df['nombre'][i][0:4]+df['apellido'][i][0:2]
      df.at[i, 'apodo'] = var_apodo

In [ ]:
df

       nombre   apellido   apodo  edad     level  nacimiento
0  Jose Maria  Vallorani  JoseMa    20     Mucho        1900
1  Maria-Ines   Orellana    Maru    78      Algo        1942
2     Agustin    Bonilla  Tincho    31  Bastante        1989
3        Ioan    Cervera    Ioan    23     Mucho        1997
4     Avelina       Haro  AvelHa    34     Mucho        1986
5   Anastasia     Picazo  AnasPi    78      Nada        1942
6       Yaiza     Oliver   Yaiza    22      Algo        1995
7      Arturo    Sanchez     Rey    19  Bastante        2001
8        Jose      Casas    Pepe    22     Mucho        1998
9   Cristian     Verdugo  CrisVe    21     Mucho        1999

Las posiciones 5,6 y 9 fueron reemplazadas:


 ![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fe7163ee5-fa62-4373-92b4-de50fc86727d%2FUntitled.png?table=block&id=b3f16134-74ae-4c77-9ab8-42fe107524a5&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=1200&userId=&cache=v2)

### 05 Segundo desaf√≠o: ¬ø el a√±o de nacimiento se corresponde con la edad registrada? üë®‚Äçüè´

*   Para informarlo cree una nueva columna de nombre 'valido', que contenga TRUE en caso de ser afirmativo y FALSE en caso de negativo
 ![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F503bdd87-eafd-4e8d-982b-1e1a64aad5f4%2FUntitled.png?table=block&id=47060bb4-9e54-4557-abe3-aad5f77c0671&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=1250&userId=&cache=v2)

In [ ]:
# restemos columnas
2021-df['edad']-df['nacimiento']

0    101
1      1
2      1
3      1
4      1
5      1
6      4
7      1
8      1
9      1
dtype: int64

In [ ]:
# dado que pudo nacer en la primer mitad del a√±o o en la segunda dejaremos <= 1
2021-df['edad']-df['nacimiento'] <=1

0    False
1     True
2     True
3     True
4     True
5     True
6    False
7     True
8     True
9     True
dtype: bool

In [ ]:
#### 05.01 Finalicemos el desaf√≠o, creando la nueva columna pedida con la informaci√≥n pedida
df['valido'] = 2021-df['edad']-df['nacimiento'] <=1

In [ ]:
df

       nombre   apellido   apodo  edad     level  nacimiento  valido
0  Jose Maria  Vallorani  JoseMa    20     Mucho        1900   False
1  Maria-Ines   Orellana    Maru    78      Algo        1942    True
2     Agustin    Bonilla  Tincho    31  Bastante        1989    True
3        Ioan    Cervera    Ioan    23     Mucho        1997    True
4     Avelina       Haro  AvelHa    34     Mucho        1986    True
5   Anastasia     Picazo  AnasPi    78      Nada        1942    True
6       Yaiza     Oliver   Yaiza    22      Algo        1995   False
7      Arturo    Sanchez     Rey    19  Bastante        2001    True
8        Jose      Casas    Pepe    22     Mucho        1998    True
9   Cristian     Verdugo  CrisVe    21     Mucho        1999    True

### 06 Tercer desaf√≠o, conocer cantidades : ¬øCu√°ntas personas saben Mucho's, Algo's, Bastante's, Nada's hay ?

 ![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F6908e014-1254-4f22-9d99-59a88e5e9e02%2FUntitled.png?table=block&id=ade73c5d-3480-4114-bc09-ae91be34806e&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=1110&userId=&cache=v2)

In [ ]:
pd.value_counts(df['level'])

NameError: ignored

### 07 Cuarto desaf√≠o Contar vocales: ü•ã

1.   Crear una columna para cada vocal (a,e,i,o,u) y contar cuantas aparecen para cada nombre
2.   Crear una columna 'suma vocales' donde sume todas las vocales para cada nombre

Obviamente usaremos c√≥digo que ya trabajamos en el taller anterior


 ![texto alternativo](https://www.notion.so/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F5baaf6c1-fda8-4e98-a9bd-81583c62e3ef%2FUntitled.png?table=block&id=896a35b9-731b-4686-850c-878ea002ad4d&spaceId=62aa27de-48fd-4703-8a40-2de64b627b11&width=1340&userId=&cache=v2)

In [ ]:
def buscarLetra(texto,letra_buscada):
  '''ingresa un texto y me devuelve la cantidad de letras a'''
  # 1 ) todo a min√∫sculas
  texto = texto.lower()
  # 2) contador que suma 1 cuando es igual a una A
  contador = 0

  for letra in texto:
    if letra == letra_buscada:
      contador = contador + 1
  # retorno la letra buscada y su cantidad
  return contador

In [ ]:
buscarLetra("nicolas","o")

1

In [ ]:
## apply:
## df['nombre'].apply(buscarLetra, letra_buscada='a')

In [ ]:
df

In [ ]:
df['a'] = df['nombre'].apply(buscarLetra, letra_buscada = 'a')
df['e'] = df['nombre'].apply(buscarLetra, letra_buscada = 'e')
df['i'] = df['nombre'].apply(buscarLetra, letra_buscada = 'i')
df['o'] = df['nombre'].apply(buscarLetra, letra_buscada = 'o')
df['u'] = df['nombre'].apply(buscarLetra, letra_buscada = 'u')

In [ ]:
df

#### 07.01 Sumemos las vocales

In [ ]:
df['vocales'] = df[['a','e','i','o','u']].sum(axis=1)
df

#### 07.02 ordenamos de menor a mayor segu√∫n la cantidades de vocales

In [ ]:
df.sort_values('vocales',ascending=False)